/*
 * _______________#########_______________________ 
 * ______________############_____________________ 
 * ______________#############____________________ 
 * _____________##__###########___________________ 
 * ____________###__######_#####__________________ 
 * ____________###_#######___####_________________ 
 * ___________###__##########_####________________ 
 * __________####__###########_####_______________ 
 * ________#####___###########__#####_____________ 
 * _______######___###_########___#####___________ 
 * _______#####___###___########___######_________ 
 * ______######___###__###########___######_______ 
 * _____######___####_##############__######______ 
 * ____#######__#####################_#######_____ 
 * ____#######__##############################____ 
 * ___#######__######_#################_#######___ 
 * ___#######__######_######_#########___######___ 
 * ___#######____##__######___######_____######___ 
 * ___#######________######____#####_____#####____ 
 * ____######________#####_____#####_____####_____ 
 * _____#####________####______#####_____###______ 
 * ______#####______;###________###______#________ 
 * ________##_______####________####______________ 
 * 
 * @Author: 崩布猪
 * @Date: 2024-08-18 15:50:34
 * @LastEditors: 崩布猪
 * @LastEditTime: 2024-09-03 11:33:46
 * @FilePath: \web\part2 work\part2\src\services\phone.jsx
 * @Description: 
 * 
 */

import axios from 'axios'
 
const baseUrl = 'http://localhost:3001/persons'
 
// 获取所有
const getAll = () => {
    const request = axios.get(baseUrl)
    return request.then(response => response.data)
}
 
// 创建新
const create = newObject => {
    const request = axios.post(baseUrl, newObject)
    
    return request.then(response => response.data)
}
// 删除
const deletePsn = id => {
    const request = axios.delete(`${baseUrl}/${id}`)
    return request.then(response => response.data)
}

// 更新
const updatePsn = (id, updatedObject) => {
    const request = axios.put(`${baseUrl}/${id}`, updatedObject)
    return request.then(response => response.data)
}


export default {
    getAll,
    create,
    deletePsn,
    updatePsn
}